'''
Всім відомо, що для доступу до кредитної картки банку потрібний пін-код. Класично склалося, 
що це поєднання чотири цифри. Нам необхідно вирішити наступне програмістське завдання. 
Є підготовлений перелік пін-кодів. Напишіть функцію is_valid_pin_codes, яка буде приймати 
як параметр список цих пін-кодів — рядок з чотирьох цифр і повертати логічне значення — валідний 
список чи ні. Переконайтеся, що серед цих пін-кодів у списку не буде дублікатів, всі вони 
зберігаються у вигляді рядків, їх довжина дорівнює 4 символам і містять вони тільки цифри.

Приклад аргументу для функції is_valid_pin_codes:

['1101', '9034', '0011']
Якщо список відповідає всім поставленим умовам, функція повертає логічне значення True. 
Якщо хоч одну з умов порушено, повертається значення — False. Передбачити перевірку на порожній 
список в аргументі функції та повернути при цьому значення False.
'''


def is_valid_pin_codes(pin_codes):
    if not pin_codes:
        return False
#    test_str = 'abcd'
    number_set = {'1', '2', '3', '4', '5', '6', '7', '8', '9', '0'}
    check_set = set(pin_codes)
    for rows in pin_codes:
        for element in rows:
            if element not in number_set:
                return False
        #if type(rows) != type(test_str):
        if not isinstance (rows, str):
            return False
        if len(rows) != 4:
            return False
        
    if len(check_set) != len(pin_codes):
        return False
    else:
        return True
print(is_valid_pin_codes(['1101', '9034', '0011']))