'''
Розберемо просту техніку кодування та декодування на основі серій. Наприклад, у нас є список із повторюваними спостереженнями якоїсь величини, вона може 
приймати значення X, Y або Z. Значення з'являються у довільному порядку та зберігаємо ми їх у списку ["X", "X", "X", "Z", "Z", "X", "X", "Y", "Y", "Y", "Z", "Z"] 
або рядку "XXXZZXXYYYZZ".

Внаслідок чого ми можемо зменшити обсяг інформації, що зберігається? Стиснення можна досягти заміною групи повторюваних значень на одноразове значення та 
лічильник повторів: ["X", 3, "Z", 2, "X", 2, "Y", 3, "Z", 2]

Напишіть рекурсивну функцію decode для декодування списку, закодованого цим способом. Як аргумент функція приймає закодований список. Функція має повернути розшифрований список елементів.
'''

def decode(data):   
    x = ()
    y = 0
    decoded_data = []
    string = ''
    data_1 = []
    data_2 = []
    if data == []:
        return([])
    else:
        x = data[0]
        a = data.pop(0)
        y = data[0]
        a = data.pop(0)
        data_1.extend(x*y)
        data_2 = decode(data)
        decoded_data = data_1 + data_2

    return(decoded_data)    

data = ["X", 3, "Z", 2, "X", 2, "Y", 3, "Z", 2]
print (decode(data))

