'''
Дуже часто люди у своїх повідомленнях не ставлять великі літери, особливо це стало масовим явищем в 
еру мобільних. пристроїв. Розробіть функцію capital_text, яка прийматиме на вхід рядок з текстом і 
повертатиме рядок з відновленими великими літерами.

Функція повинна:

зробити великою першу літеру в рядку, попри прогалини
зробити великою першу літеру після точки, попри прогалини
зробити великою першу літеру після знака оклику, попри прогалини
зробити великою першу літеру після знака питання, попри прогалини
'''

def capital_text(s):
    s = s.capitalize()
    list = s.split()
    s_new = ''
    i = 0 
    for word in list:
        if i == 1:
            word = word.capitalize()
            i = 0
        if word.find('.') != -1:
            i = 1
        elif word.find('!') != -1:
            i = 1
        elif word.find('?') !=-1:
            i = 1
        elif word.find('/n') !=-1:
            i = 1
        s_new = s_new + word + " "
    s_new = s_new.rstrip()
    return(s_new)


s = 'K;jsed;fj. s;dkjf ;dfjld;kjd'
print(capital_text(s))